Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For example the https://github.com/quarkusio/search.quarkus.io[Quarkus documentation search engine] on https://quarkus.io[quarkus.io] uses the Web Bundler to create a full-stack web-component. With Lit Element for the web-component and OpenSearch for the indexation it is a nice way to enhance the static web-site experience in a dynamic way.
ja_jp: たとえば、 https://quarkus.io[quarkus.io] の https://github.com/quarkusio/search.quarkus.io[Quarkus ドキュメント検索エンジン] は、Web Bundler を使用してフルスタックの Web コンポーネントを作成します。Web コンポーネントに Lit Element、インデックス作成に OpenSearch を使用すると、静的な Web サイトのエクスペリエンスを動的に強化できます。

source: For example to switch back to an UBI8 _builder image_ you can use:
ja_jp: 例えば、UBI8の _ビルダーイメージ_ に戻すには、次のようにします：

source: For example with a configuration like:
ja_jp: 例えば、次のような設定の場合:

source: For example,
ja_jp: 例えば

source: For example, English:
ja_jp: 例えば、英語の場合:

source: For example, Quarkus optimizes the Hibernate code because it knows it only needs a specific connection pool and cache provider
ja_jp: たとえば、Quarkusは、特定の接続プールとキャッシュプロバイダだけが必要であることを知っているため、Hibernateコードを最適化します。

source: For example, The following code illustrates how you can store incoming payloads to a database using Hibernate with Panache:
ja_jp: 例えば、以下のコードは、Hibernate with Panacheを 使用してデータベースに受信ペイロードを格納する方法を示しています。

source: For example, `quarkus-agroal` that is used to manage Quarkus datasource(s) automatically register a readiness health check that will validate each datasource: xref:datasource.adoc#datasource-health-check[Datasource Health Check].
ja_jp: 例えば、Quarkusのデータソースを管理するために使用される `quarkus-agroal` は、各 link:datasource.html#datasource-health-check[データソースのヘルスチェック] を検証するReadinessのヘルスチェックを自動的に登録します。

source: For example, `quarkus-agroal` that is used to manage Quarkus datasource(s) automatically register a readiness health check that will validate each datasources: xref:datasource.adoc#datasource-health-check[Datasource Health Check].
ja_jp: 例えば、Quarkusのデータソースを管理するために使用される `quarkus-agroal` は、各 link:datasource.html#datasource-health-check[データソースのヘルスチェック]を検証するReadinessのヘルスチェックを自動的に登録します。 。

source: For example, a 64-byte key is required to sign a token by using the `HS512` algorithm (`512/8`), and a 32-byte key is needed to encrypt the content encryption key with the `A256KW` algorithm (`256/8`):
ja_jp: たとえば、 `HS512` アルゴリズム (`512/8`) を使用してトークンに署名するには 64 バイトのキーが、 `A256KW` アルゴリズム (`256/8`) を使用してコンテンツ暗号鍵を暗号化するには 32 バイトのキーが必要です。

source: For example, a `Book` may need to have a `null` identifier when passed to the `post` method (because the identifier will be generated), but a non-`null` identifier when passed to the `put` method (because the method needs the identifier to know what to update).
ja_jp: 例えば、 `Book` は、 `post` メソッドに渡されるときには `null` 識別子が必要ですが（識別子が生成されるため）、 `put` メソッドに渡されるときには `null` 以外の識別子が必要になる場合があります（メソッドが更新内容を知るために識別子を必要とするため）。

source: For example, a filter can analyze the request body and add its digest as a new header value:
ja_jp: たとえば、フィルターでリクエストボディを分析し、そのダイジェストを新しいヘッダー値として追加できます。

source: For example, a provider that supports both global and application-specific end-session endpoints returns a global end-session URL such as `http://localhost:8180/oidcprovider/account/global-logout`. This URL logs the user out of all applications the user is currently logged into.
ja_jp: 例えば、グローバルとアプリケーション固有のセッション終了エンドポイントの両方をサポートするプロバイダーは、 `http://localhost:8180/oidcprovider/account/global-logout` のようなグローバルセッション終了 URL を返します。 この URL は、ユーザーが現在ログインしているすべてのアプリケーションからユーザーをログアウトします。

source: For example, add `-Dquarkus.openshift.route.expose=true` to the above command. For more information, see xref:deploying-to-openshift.adoc#exposing_routes[Exposing routes].
ja_jp: 例えば、上記のコマンドに `-Dquarkus.openshift.route.expose=true` を追加します。 詳細については、 xref:deploying-to-openshift.adoc#exposing_routes[ルートを公開する] を参照してください。

source: For example, add the following to your `application.properties`:
ja_jp: 例えば、次を `application.properties` に追加して下さい。

source: For example, after you have configured the <<google>> provider, you can have events added to the user's Google Calendar by using a REST client as shown in the following example:
ja_jp: たとえば、<<google>> プロバイダーの場合、次の例に示すように、REST クライアントを使用して、ユーザーの Google カレンダーにイベントを追加できます。

source: For example, assume `Okta` is your SAML 2.0 provider and `Keycloak` is your OIDC provider. Here is a typical sequence explaining how to configure `Keycloak` to broker with the `Okta` SAML 2.0 provider.
ja_jp: たとえば、 `Okta` が SAML 2.0 プロバイダで、 `Keycloak` が OIDC プロバイダであると仮定しましょう。 `Okta` SAML 2.0 プロバイダとブローカするために `Keycloak` を構成する方法を説明する、典型的なシーケンスを以下に示します。

source: For example, assume `Okta` is your SAML 2.0 provider and `Keycloak` is your OIDC provider. Here is a typical sequence for configuring `Keycloak` to act as a broker with the `Okta` SAML 2.0 provider.
ja_jp: たとえば、 `Okta` が SAML 2.0 プロバイダーで、 `Keycloak` が OIDC プロバイダーだとします。 ここでは、 `Keycloak` を `Okta` SAML 2.0 プロバイダーと仲介するように設定する一般的なシーケンスを示します。

source: For example, assume that the Quarkus endpoint must access a microservice that returns a user name.
ja_jp: たとえば、Quarkus エンドポイントがユーザー名を返すマイクロサービスにアクセスする必要があると仮定します。

source: For example, at build time, Quarkus reads part of the application configuration, scans the classpath for annotated classes, and constructs a model of the application. By doing this early, Quarkus has enough information to eliminate unnecessary components and compute the exact startup instructions required.
ja_jp: 例えば、ビルド時において、Quarkusはアプリケーション設定の一部を読み込み、アノテーションが付加されたクラスのクラスパスをスキャンし、アプリケーションのモデルを構築します。この早期処理により、Quarkusは不要なコンポーネントを排除し、必要な正確な起動命令を計算するのに十分な情報を得ることができます。

source: For example, building multi-platform images is implemented differently for Docker and Podman. Docker uses https://docs.docker.com/engine/reference/commandline/buildx_build/[the buildx plugin] whereas Podman can build multi-platform images https://docs.podman.io/en/latest/markdown/podman-build.1.html#platform-os-arch-variant[natively]. Because of this, you would need to use the specific extension to perform that function.
ja_jp: 例えば、マルチプラットフォームイメージのビルドはDockerとPodmanで実装が異なります。Dockerは link:https://docs.docker.com/engine/reference/commandline/buildx_build/[buildxプラグイン] を使用しますが、Podmanはマルチプラットフォームイメージを link:https://docs.podman.io/en/latest/markdown/podman-build.1.html#platform-os-arch-variant[ネイティブ] にビルドできます。このため、その機能を実行するには特定のエクステンションを使用する必要があります。

source: For example, by default, a test container will be available at a randomly allocated port but you can make both Keycloak Admin Client and the container use the same port as follows:
ja_jp: 例えば、デフォルトでは、テストコンテナはランダムに割り当てられたポートで利用可能ですが、以下のようにKeycloak Admin Clientとコンテナの両方が同じポートを使用するようにすることができます：

source: For example, by using the `@ReadLock` annotation on the `getNumberOfBookings` method, we are able to tell the STM subsystem that no state modifications will occur in this object when it is used in the transactional memory. Also, the `@NotState` annotation tells the system to ignore `timesCalled` when transactions commit or abort, so this value only changes due to application code.
ja_jp: 例えば、 `getNumberOfBookings` メソッドに `@ReadLock` アノテーションを使用することで、このオブジェクトがトランザクションメモリーで使用されているときに、状態の変更がこのオブジェクトでは発生しないことを STM サブシステムに伝えることができます。また、 `@NotState` アノテーションは、トランザクションがコミットまたは中止されたときに `timesCalled` を無視するようにシステムに指示するので、この値はアプリケーションコードによってのみ変化します。

source: For example, clicking *Swagger UI* opens the Swagger UI in a new browser tab where you can test the service by using the token acquired by Dev UI for Keycloak. The Swagger UI does not try to re-authenticate again. In the Swagger UI, do not choose a Swagger UI `Authorize` option; the OIDC Dev UI has authorized and provided the access token for Swagger UI to use for testing.
ja_jp: たとえば、*Swagger UI* をクリックすると、新しいブラウザータブで Swagger UI が開き、Keycloak 用の Dev UI によって取得されたトークンを使用してサービスをテストできます。 Swagger UI は再度認証を試行しません。 Swagger UI で、Swagger UI の `Authorize` オプションを選択しないでください。OIDC Dev UI が Swagger UI を認可し、テストに使用するアクセストークンを提供しているためです。

source: For example, clicking on `Swagger UI` will open `Swagger UI` in a new browser tab where you can test the service using the token acquired by Dev UI for Keycloak. and `Swagger UI` will not try to re-authenticate again.
ja_jp: たとえば、 `Swagger UI` をクリックすると、新しいブラウザータブで `Swagger UI` が開き、Dev UI for Keycloak によって取得されたトークンを使用してサービスをテストできます。また、 `Swagger UI`は再認証を試みません。

source: For example, clicking on `Swagger UI` will open `Swagger UI` in a new browser tab where you can test the service using the token acquired by Dev UI for Keycloak. and `Swagger UI` will not try to re-authenticate again. Do not choose a `Swagger UI` `Authorize` option once you are in Swagger UI since OIDC Dev UI has done the authorization and provided the access token for Swagger UI to use for testing.
ja_jp: 例えば、 `Swagger UI` をクリックすると、新しいブラウザ タブで `Swagger UI` が開き、Dev UI for Keycloak が取得したトークンを使用してサービスをテストできます。 `Swagger UI` は再認証を試みません。OIDC Dev UIが認証を行い、Swagger UIがテストに使用するアクセストークンを提供しているため、Swagger UIに入った後は `Swagger UI` `Authorize` オプションを選択しないようにしてください。

source: For example, expression `{name}` has no namespace and single part - `name`. The "name" will be resolved using all available value resolvers against the current context object. However, the expression `{global:colors}` has the namespace `global` and single part - `colors`. First, all available ``NamespaceResolver``s will be used to find the current context object. And afterwards value resolvers will be used to resolve "colors" against the context object found.
ja_jp: たとえば、式 `{name}` には名前空間がなく、単一のパーツ - `name` があります。 "name" は、現在のコンテキストオブジェクトに対して利用可能なすべての値リゾルバーを使用して解決されます。 しかし、式 `{global:colors}` には、名前空間 `global` と単一パーツ - `colors` があります。 まず、現在のコンテキストオブジェクトを見つけるために、利用可能なすべての ``NamespaceResolver`` が使用されます。 その後、見つかったコンテキストオブジェクトに対して "colors" を解決するために値リゾルバーが使用されます。

source: For example, for each JPA or Hibernate annotation, it determines the annotation target (class, method, field), or whether it is inherited.
ja_jp: たとえば、JPA または Hibernate の各アノテーションに対して、アノテーションのターゲット (クラス、メソッド、フィールド) や、それが継承されているかどうかを判断します。

source: For example, for items use: `onItem().invoke(item -> ...);`
ja_jp: 例えば、アイテム使用の場合、次を使用して下さい: `onItem().invoke(item → …​);`

source: For example, given <<use-oidc-clients,this>> `jwt-secret` named OIDC client declaration, you can refer to this client like this:
ja_jp: たとえば、<<use-oidc-clients,この>> `jwt-secret` という名前の OIDC クライアント宣言が与えられた場合、このクライアントを次のように参照できます。

source: For example, given a `codestart.yml` such as
ja_jp: 例えば、以下のような `codestart.yml` がある場合、

source: For example, given this Keycloak URL:
ja_jp: 例えば、この Keycloak の URL があるとします。

source: For example, here is a registry client configuration that replaces the default <<registry.quarkus.io,registry.quarkus.io>> registry with a custom one:
ja_jp: たとえば、以下は、デフォルトの link:#registry.quarkus.io[registry.quarkus.io]レジストリをカスタムのものに置き換えるレジストリクライアント設定です:

source: For example, here is a registry client configuration that replaces the default xref:registry.quarkus.io[registry.quarkus.io] registry with a custom one:
ja_jp: たとえば、デフォルトの xref:registry.quarkus.io[registry.quarkus.io] レジストリをカスタムレジストリに置き換えるレジストリクライアント設定を以下に示します:

source: For example, here is how a custom `TenantConfigResolver` can avoid creating the already resolved tenant configuration, that may otherwise require blocking reads from the database or other remote sources:
ja_jp: たとえば、カスタム `TenantConfigResolver` が、すでに解決されているテナント設定の作成を回避する方法は以下に示すとおりです。この作成を回避しない場合は、データベースやその他のリモートソースからの読み取りをブロックする必要がある可能性があります。

source: For example, here is how you can configure Quarkus OIDC to verify the token's certificate chain, without using `quarkus.oidc.TokenCertificateValidator`:
ja_jp: たとえば、 `quarkus.oidc.TokenCertificateValidator` を使用せずにトークンの証明書チェーンを検証するように Quarkus OIDC を設定する方法は次のとおりです。

source: For example, here is how you can return the name of the currently logged-in user:
ja_jp: たとえば、現在ログインしているユーザーの名前を返す方法は次のとおりです。

source: For example, here is how you can use `keycloak.js` to authenticate the users and refresh the expired tokens from the SPA:
ja_jp: 例えば、 `keycloak.js` を使用してユーザーを認証し、SPA から期限切れのトークンをリフレッシュする方法は以下の通りです。

source: For example, https://gitlab.com/[GitLab] provides such a registry and in the provided CI environment, makes available the `CI_REGISTRY_IMAGE` environment variable (see GitLab's https://docs.gitlab.com/ee/ci/variables/[documentation]) for more information), which can be used in Quarkus like so:
ja_jp: 例えば、 link:https://gitlab.com/[GitLab] はこのようなレジストリーを提供しており、提供されている CI 環境では、環境変数 `CI_REGISTRY_IMAGE` (詳しくは GitLab の link:https://docs.gitlab.com/ee/ci/variables/[ドキュメント] を参照) を利用できるようになっています。なお、Quarkus ではこのように利用できます。

source: For example, if a user is trying to access a Quarkus service endpoint at `http://localhost:8080/service/1`, then the `redirect_uri` parameter is set to `http://localhost:8080/service/1`.
ja_jp: たとえば、ユーザーが `http://localhost:8080/service/1` の Quarkus サービスエンドポイントにアクセスしようとしている場合、 `redirect_uri` パラメーターは `http://localhost:8080/service/1` に設定されます。

source: For example, if both `container-image-docker` and `container-image-openshift` are present and the user needs to use `container-image-docker`:
ja_jp: 例えば、 `container-image-docker` と `container-image-openshift` の両方が存在し、ユーザーが `container-image-docker` を使う必要がある場合：

source: For example, if both `container-image-docker` and `container-image-podman` are present and the user needs to use `container-image-docker`:
ja_jp: 例えば、 `container-image-docker` と `container-image-podman` の両方が存在し、ユーザーが `container-image-docker` を使用する必要がある場合：

source: For example, if both `container-image-docker` and `container-image-s2i` are present and the user needs to use `container-image-docker`:
ja_jp: 例えば、 `container-image-docker` と `container-image-s2i` の両方が存在し、ユーザーが `container-image-docker` を使用する場合:

source: For example, if the JavaScript engine sets a header such as `HX-Request: true`, then you can have it checked like this:
ja_jp: たとえば、JavaScript エンジンが `HX-Request: true` などのヘッダーを設定する場合は、次のようにチェックできます。

source: For example, if the base images `ubi8/openjdk-11-runtime` or `ubi8/openjdk-17-runtime` are used to build the container, the entry point can be hard-coded on the application properties file.
ja_jp: 例えば、コンテナの構築にベースイメージ `ubi8/openjdk-11-runtime` や `ubi8/openjdk-17-runtime` を使用する場合、アプリケーションのプロパティファイル上でエントリポイントをハードコードすることができます。

source: For example, if the base images `ubi8/openjdk-11-runtime`, `ubi8/openjdk-17-runtime` or `ubi8/openjdk-21-runtime` are used to build the container, the entry point can be hard-coded on the application properties file.
ja_jp: たとえば、ベースイメージ `ubi8/openjdk-11-runtime` 、 `ubi8/openjdk-17-runtime` 、 `ubi8/openjdk-21-runtime` を使用してコンテナをビルドする場合、アプリケーションのプロパティファイルにエントリポイントをハードコードすることができます。

source: For example, if the base images `ubi9/openjdk-17-runtime` or `ubi9/openjdk-21-runtime` are used to build the container, the entry point can be hard-coded on the application properties file.
ja_jp: たとえば、コンテナのビルドにベースイメージ `ubi9/openjdk-17-runtime` または `ubi9/openjdk-21-runtime` を使用する場合、アプリケーションのプロパティファイルにエントリポイントをハードコードすることができます。

source: For example, if there is an expression `item.name` where `item` maps to `org.acme.Item` then `Item` must have a property `name` or a matching template extension method must exist.
ja_jp: 例えば、 `item.name` という式があり、 `item` が `org.acme.Item` にマップされている場合、 `Item` には `name` というプロパティーがあるか、一致するテンプレート拡張メソッドが存在しなければなりません。

source: For example, if there's a parameter declaration `{@String foo="Ping"}` and `foo` is not found then you can use `{foo}` and the output will be `Ping`. On the other hand, if the value is set (e.g. via `TemplateInstance.data("foo", "Pong")`) then the output of `{foo}` will be `Pong`.
ja_jp: たとえば、パラメーター宣言 `{@String foo="Ping"}` があり、`foo` が見つからない場合、`{foo}` を使用すると `Ping` が出力されます。 一方、(たとえば `TemplateInstance.data("foo", "Pong")` を介して) 値が設定されている場合は、`{foo}` の出力は `Pong` となります。

source: For example, if this property is set to `3S` and the access token will expire in less than 3 seconds, the token is refreshed automatically.
ja_jp: たとえば、このプロパティーが `3S` に設定されており、アクセストークンが 3 秒未満で期限切れになる場合、トークンは自動的にリフレッシュされます。

source: For example, if we have our own `Cheese` type on our endpoint:
ja_jp: たとえば、エンドポイントに独自の `Cheese` 型がある場合:

source: For example, if we have our own `FroMage` type on our endpoint:
ja_jp: 例えば、エンドポイントに独自の `FroMage` 型がある場合:

source: For example, if we invoke the `/records` endpoint using curl to return a list of records, the HAL format will look like as follows:
ja_jp: たとえば、curl を使用して `/records` エンドポイントを呼び出してレコードのリストを返す場合、HAL 形式は次のようになります。

source: For example, if you declare
ja_jp: たとえば、以下のように宣言した場合

source: For example, if you need to send a message to a stream when receiving a POST request inside a REST endpoint. In this case, you cannot use `@Outgoing` because your method has parameters.
ja_jp: たとえば、REST エンドポイント内で POST リクエストを受信した際に、ストリームにメッセージを送信する必要があるとします。この場合、メソッドにパラメーターがあるため、 `@Outgoing` を使用することはできません。

source: For example, if you need to update a value in a hash only if the field exists, you will use the following API:
ja_jp: たとえば、フィールドが存在する場合にのみハッシュの値を更新する必要がある場合は、以下のような API を使用することになります。

source: For example, if you use the following `proto` file snippet:
ja_jp: 例えば、以下の `proto` ファイルスニペットを使用した場合は、

source: For example, if you want to get two `People` entities in the first page, you should call `http://localhost:8080/people?page=0&size=2`, and the response should look like:
ja_jp: たとえば、最初のページで2つの `People` エンティティを取得したい場合、 `http://localhost:8080/people?page=0&size=2` を呼び出します。応答は次のようになる筈です:

source: For example, if you work with Keycloak, you can use `keycloak.js` to authenticate users and refresh the expired tokens from the SPA:
ja_jp: たとえば、Keycloak を使用する場合は、 `keycloak.js` を使用してユーザーを認証し、SPA から期限切れのトークンを更新できます。

source: For example, if your OIDC provider sets a token audience, consider the following configuration pattern:
ja_jp: たとえば、OIDC プロバイダーでトークンオーディエンスを設定する場合は、次の設定パターンを検討してください。

source: For example, if your OpenID Connect provider sets a token audience then the following configuration pattern is recommended:
ja_jp: たとえば、OpenID Connect プロバイダーがトークンオーディエンスを設定する場合、次の設定パターンが推奨されます。

source: For example, if your Quarkus endpoint runs in a cluster behind Kubernetes Ingress then a redirect from the OpenID Connect Provider back to this endpoint may not work since the calculated `redirect_uri` parameter may point to the internal endpoint address. This problem can be resolved with the following configuration:
ja_jp: 例えば、Quarkus のエンドポイントが Kubernetes Ingress の背後にあるクラスターで実行されている場合、計算された `redirect_uri` パラメーターが内部のエンドポイントアドレスを指している可能性があるので、OpenID Connect Provider からこのエンドポイントへのリダイレクトは機能しないかもしれません。この問題は、以下のような設定で解決することができます。

source: For example, if your Quarkus endpoint runs in a cluster behind Kubernetes Ingress, then a redirect from the OIDC provider back to this endpoint might not work because the calculated `redirect_uri` parameter might point to the internal endpoint address.
ja_jp: たとえば、Quarkus エンドポイントが Kubernetes Ingress の背後にあるクラスターで実行されている場合、計算された `redirect_uri` パラメーターが内部エンドポイントアドレスを指している可能性があるため、OIDC プロバイダーからこのエンドポイントへのリダイレクトが機能しない可能性があります。

source: For example, if your Quarkus endpoint runs in a cluster behind Kubernetes Ingress, then a redirect from the OIDC provider back to this endpoint might not work because the calculated `redirect_uri` parameter might point to the internal endpoint address. You can resolve this problem by using the following configuration, where `X-ORIGINAL-HOST` is set by Kubernetes Ingress to represent the external endpoint address.:
ja_jp: たとえば、Quarkus エンドポイントが Kubernetes Ingress の背後にあるクラスターで実行されている場合、計算された `redirect_uri` パラメーターが内部エンドポイントアドレスを指している可能性があるため、OIDC プロバイダーからこのエンドポイントへのリダイレクトが機能しない可能性があります。 この問題は、Kubernetes Ingress によって外部エンドポイントアドレスを表すように `X-ORIGINAL-HOST` が設定されている次の設定を使用することで解決できます。

source: For example, in the `kubernetes-quickstart` application, we can add a `kubernetes.yml` file in the `src/main/kubernetes` that looks like:
ja_jp: 例えば、 `kubernetes-quickstart` アプリケーションでは、 `src/main/kubernetes` の中に `kubernetes.yml` のようなファイルを追加することができます。

source: For example, let's assume `org.acme:acme-quarkus-bom` platform extends the `io.quarkus:quarkus-bom` platform by importing its BOM. In case, the `org.acme:acme-quarkus-bom` platform were to override certain properties defined in the `io.quarkus:quarkus-bom-quarkus-platform-properties` included in the `io.quarkus:quarkus-bom`, the `org.acme:acme-quarkus-bom` would have to be composed as
ja_jp: 例えば、 `org.acme:acme-quarkus-bom` プラットフォームは `io.quarkus:quarkus-bom` プラットフォームをベースにしています。 `org.acme:acme-quarkus-bom` プラットフォームが、 `io.quarkus:quarkus-bom` プラットフォームに含まれる `io.quarkus:quarkus-bom-quarkus-platform-properties` で定義された特定のプロパティを上書きする場合、 `org.acme:acme-quarkus-bom` は次のように構成されなければなりません。

source: For example, let's assume that you wish to enable the following three Cassandra metrics:
ja_jp: たとえば、次の 3 つの Cassandra メトリクスを有効にする場合には、以下のとおりです。

source: For example, let's assume the ID token age is 6 hours and therefore the session cookie age is also 6 hours. If the user accessed Quarkus 1 hour before it was about to expire, and then stayed idle for 2 hours, then, after the user accesses Quarkus again, 7 hours after the session cookie was created and 1 hour after it and the ID token got expired and removed by the browser, Quarkus OIDC can only request the user re-authentication since it can no longer see the session cookie. To minimize a number of re-authentication attempts, consider extending the session age, for example, by 3 hours. Now, given the last example, Quarkus OIDC may still get access to the expired ID token and do somethnig useful with it if required - refresh it or offer a user a session expired page, instead of immediately requesting a new authentication.
ja_jp: たとえば、ID トークンの有効期間が 6 時間であり、したがってセッション Cookie の有効期間も 6 時間であると想定します。ユーザーが期限切れの 1 時間前に Quarkus にアクセスし、その後 2 時間アイドル状態であった場合、セッション Cookie 作成から 7 時間後 (ID トークンと Cookie が期限切れになりブラウザーから削除された 1 時間後) にユーザーが再び Quarkus にアクセスした際、Quarkus OIDC はセッション Cookie を確認できないため、ユーザーに再認証を要求することしかできません。再認証の試行回数を最小限に抑えるには、セッション有効期間をたとえば 3 時間延長することを検討してください。この最後の例のような設定であれば、Quarkus OIDC は期限切れの ID トークンにまだアクセスできる可能性があり、必要に応じて、すぐに新しい認証を要求する代わりに、トークンをリフレッシュしたりユーザーにセッション期限切れページを提示したりといった有用な処理を行うことができます。

source: For example, let's assume the Quarkus endpoint has to access a microservice that returns a user name. First, create a REST client:
ja_jp: たとえば、Quarkus エンドポイントがユーザー名を返すマイクロサービスにアクセスする必要があるとします。 まず、REST クライアントを作成します。

source: For example, let's assume you need to redirect the current user whose session has expired to a custom session expired page available at `http://localhost:8080/session-expired-page`. The following custom `OidcRedirectFilter` encrypts the user name in a custom `session_expired` cookie using an OIDC tenant client secret:
ja_jp: たとえば、セッションの有効期限が切れた現在のユーザーを、 `http://localhost:8080/session-expired-page` で利用できるカスタムセッション期限切れページにリダイレクトする必要があるとします。次のカスタム `OidcRedirectFilter` は、OIDC テナントクライアントシークレットを使用して、カスタム `session_expired` Cookie 内のユーザー名を暗号化します。

source: For example, let's assume you need to redirect the current user whose session has expired to a custom session-expired page available at `http://localhost:8080/session-expired-page`. The following custom `OidcRedirectFilter` encrypts the user name in a custom `session_expired` cookie using an OIDC tenant client secret:
ja_jp: たとえば、セッションの有効期限が切れた現在のユーザーを、 `http://localhost:8080/session-expired-page` で利用できるカスタムセッション期限切れページにリダイレクトする必要があるとします。 次のカスタム `OidcRedirectFilter` は、OIDC テナントクライアントシークレットを使用して、カスタム `session_expired` Cookie 内のユーザー名を暗号化します。

source: For example, name it as `OktaSaml`:
ja_jp: たとえば、 `OktaSaml` と名前を付けます。

source: For example, one needs to have a 64 byte key to sign using the `HS512` algorithm (`512/8`) and a 32 byte key to encrypt the content encryption key with the `A256KW` algorithm (`256/8`):
ja_jp: たとえば、 `HS512` アルゴリズム (`512/8`) を使用して署名するには 64 バイトのキーが必要であり、 `A256KW` アルゴリズム (`256/8`) を使用してコンテンツ暗号化キーを暗号化するには 32 バイトのキーが必要です。
